> Apply Update 2 or later.

Tested with 7.0 update 2 . Its successfully creating the cluster but it triggered issue with resource pool deployment for standalone ESXi host.
`ServerFaultCode: The operation is not supported on the object.`
![image](https://user-images.githubusercontent.com/41516771/220089571-1ecce5c9-6882-4fcd-ac2a-2e7f5c10e6ef.png)

Terraform apply 
```

# module.foundation.vsphere_resource_pool.resource_pool["esxi-demo-pool01"] will be created
  + resource "vsphere_resource_pool" "resource_pool" {
      + cpu_expandable           = true
      + cpu_limit                = -1
      + cpu_reservation          = 0
      + cpu_share_level          = "normal"
      + cpu_shares               = (known after apply)
      + id                       = (known after apply)
      + memory_expandable        = true
      + memory_limit             = -1
      + memory_reservation       = 0
      + memory_share_level       = "normal"
      + memory_shares            = (known after apply)
      + name                     = "esxi-demo-pool01"
      + parent_resource_pool_id  = (known after apply)
      + scale_descendants_shares = "disabled"
    }

  # module.foundation.vsphere_resource_pool.resource_pool["esxi-demo-pool02"] will be created
  + resource "vsphere_resource_pool" "resource_pool" {
      + cpu_expandable           = true
      + cpu_limit                = -1
      + cpu_reservation          = 0
      + cpu_share_level          = "normal"
      + cpu_shares               = (known after apply)
      + id                       = (known after apply)
      + memory_expandable        = true
      + memory_limit             = -1
      + memory_reservation       = 0
      + memory_share_level       = "normal"
      + memory_shares            = (known after apply)
      + name                     = "esxi-demo-pool02"
      + parent_resource_pool_id  = (known after apply)
      + scale_descendants_shares = "disabled"
    }
```
